import { QuestionCardType } from "@main/types/questionCardTypes";

// export const questionCards: Array<QuestionCardType> = [
//     {
//         id: 1,
//         title: "Настроение",
//         options: [
//             {
//                 icon: "😠",
//                 text: "Ужасно",
//             },
//             {
//                 icon: "☹️",
//                 text: "Плохо",
//             },
//             {
//                 icon: "😐",
//                 text: "Нейтрально",
//             },
//             {
//                 icon: "😌",
//                 text: "Хорошо",
//             },
//             {
//                 icon: "😊",
//                 text: "Отлично",
//             },
//         ],
//     },
//     {
//         id: 2,
//         title: "Питание",
//         options: [
//             {
//                 icon: "🍽",
//                 text: "Ничего",
//             },
//             {
//                 icon: "☕",
//                 text: "Мало",
//             },
//             {
//                 icon: "🥪",
//                 text: "Средне",
//             },
//             {
//                 icon: "🥞",
//                 text: "Много",
//             },
//             {
//                 icon: "🎂",
//                 text: "Объелся",
//             },
//         ],
//     },
//     {
//         id: 3,
//         title: "Уровень тревожности",
//         options: [
//             {
//                 icon: "🙂",
//                 text: "Спокоен",
//             },
//             {
//                 icon: "😞",
//                 text: "Немного",
//             },
//             {
//                 icon: "😨",
//                 text: "Средне",
//             },
//             {
//                 icon: "😫",
//                 text: "Достаточно",
//             },
//             {
//                 icon: "🥵",
//                 text: "Сильно",
//             },
//         ],
//     },
//     {
//         id: 4,
//         title: "Как спалось",
//         options: [
//             {
//                 icon: "😶",
//                 text: "Без сна",
//             },
//             {
//                 icon: "🛌",
//                 text: "Мало",
//             },
//             {
//                 icon: "😪",
//                 text: "Средне",
//             },
//             {
//                 icon: "😴",
//                 text: "Хорошо",
//             },
//             {
//                 icon: "💤",
//                 text: "Много",
//             },
//         ],
//     },
//     {
//         id: 5,
//         title: "Эмоциональный фон",
//         options: [
//             {
//                 icon: "👿",
//                 text: "Зло",
//             },
//             {
//                 icon: "😡",
//                 text: "Ужасно",
//             },
//             {
//                 icon: "😑",
//                 text: "Нейтрально",
//             },
//             {
//                 icon: "🛋",
//                 text: "На чиле",
//             },
//             {
//                 icon: "🌈",
//                 text: "Радость",
//             },
//         ],
//     },
//     {
//         id: 6,
//         title: "Уровень активность",
//         options: [
//             {
//                 icon: "😴",
//                 text: "Спать",
//             },
//             {
//                 icon: "🛌",
//                 text: "Лежать",
//             },
//             {
//                 icon: "🙆‍♂",
//                 text: "Медитировать",
//             },
//             {
//                 icon: "🏃‍",
//                 text: "Гулять",
//             },
//             {
//                 icon: "🎉",
//                 text: "Праздновать",
//             },
//         ],
//     },
//     {
//         id: 7,
//         title: "Саморефлексия",
//         options: [
//             {
//                 icon: "👎🏻",
//                 text: "Плохо",
//             },
//             {
//                 icon: "🤷‍️",
//                 text: "Не знаю",
//             },
//             {
//                 icon: "👍🏻",
//                 text: "Хорошо",
//             },
//         ],
//     },
// ];
